<?php



// Эта функция возвращает false, если выполнять этот модуль не требуется (напр. работа уже сделана)
// Либо - строку для отображения кнопки запуска работы.

function installmod_where() { return "`whois`!='' AND (`whois` LIKE '%\001%' OR `whois` LIKE '%".e('|')."%')"; }

function installmod_init() {
    if(!ms("SELECT COUNT(*) FROM `dnevnik_comm` WHERE ".installmod_where(),"_l",0)) return false;
    return "поправить whois";
}

// Эта функция - сама работа модуля. Если работа не требует этапов - вернуть 0,
// иначе вернуть номер позиции, с которой продолжить работу, рисуя на экране професс выполнения.
// skip - с чего начинать, allwork - общее количество (измерено ранее), $o - то, что кидать на экран.
function installmod_do() { global $o,$skip,$allwork,$delknopka; $starttime=time();



// 48126) ERROR [Тайланд] Bangkok

$flgs=array(
'Соединенное Королевство Великобритании и Северной Ирландии'             =>'UK',
'ОАЭ'                                                           =>'AE',
'Молдавия'                                                                    =>'MD',
'Чешская Республика'                                                                      =>'CZ',
'Беларуссия'                                                                 =>'BY',
'Беларусия'                                                                 =>'BY',
'Беларусь'                                                                 =>'BY',
'Russia'=>'RU',
'Russian Federation'=>'RU',
'russia'=>'RU',
'RUSSIA'=>'RU',
'RUSSIAN FEDERATION'=>'RU',
'Андорра'                                                                    =>'AD',
'Арабские Эмираты'                                                           =>'AE',
'Афганистан'                                                                 =>'AF',
'Антигуа и Барбуда'                                                          =>'AG',
'Ангилья'                                                                    =>'AI',
'Албания'                                                                    =>'AL',
'Антильские о-ва'                                                            =>'AN',
'Ангола'                                                                     =>'AO',
'Антарктика'                                                                 =>'AQ',
'Аргентина'                                                                  =>'AR',
'Американское Самоа'                                                         =>'AS',
'Австрия'                                                                    =>'AT',
'Австралия'                                                                  =>'AU',
'Армения'                                                                    =>'AM',
'Аруба'                                                                      =>'AW',
'Азербайджан'                                                                =>'AZ',
'Босния и Герцоговина'                                                       =>'BA',
'Барбадос'                                                                   =>'BB',
'Бангладеш'                                                                  =>'BD',
'Бельгия'                                                                    =>'BE',
'Буркина-Фасо'                                                               =>'BF',
'Болгария'                                                                   =>'BG',
'Бахрейн'                                                                    =>'BH',
'Бурунди'                                                                    =>'BI',
'Бенин'                                                                      =>'BJ',
'Бермуды'                                                                    =>'BM',
'Бруней'                                                                     =>'BN',
'Боливия'                                                                    =>'BO',
'Бразилия'                                                                   =>'BR',
'Багамы'                                                                     =>'BS',
'Бутан'                                                                      =>'BT',
'О-в Бювет'                                                                  =>'BV',
'Ботсвана'                                                                   =>'BW',
'Белоруссия'                                                                 =>'BY',
'Белиз'                                                                      =>'BZ',
'Канада'                                                                     =>'CA',
'Республика Конго'                                                           =>'CD',
'Центрально-Африканская Республика'                                          =>'CF',
'Конго'                                                                      =>'CG',
'Швейцария'                                                                  =>'CH',
'Кот-д`Ивуар'                                                                =>'CI',
'О-ва Кука'                                                                  =>'CK',
'Чили'                                                                       =>'CL',
'Камерун'                                                                    =>'CM',
'Китай'                                                                      =>'CN',
'Колумбия'                                                                   =>'CO',
'Коста-Рика'                                                                 =>'CR',
'Куба'                                                                       =>'CU',
'Кабо-Верде'                                                                 =>'CV',
'Кипр'                                                                       =>'CY',
'Чехия'                                                                      =>'CZ',
'Германия'                                                                   =>'DE',
'Джибути'                                                                    =>'DJ',
'Дания'                                                                      =>'DK',
'Доминика'                                                                   =>'DM',
'Доминиканская Республика'                                                   =>'DO',
'Доминикан'                                                   =>'DO',
'Алжир'                                                                      =>'DZ',
'Эквадор'                                                                    =>'EC',
'Эстония'                                                                    =>'EE',
'Египет'                                                                     =>'EG',
'Эритрея'                                                                    =>'ER',
'Испания'                                                                    =>'ES',
'Эфиопия'                                                                    =>'ET',
'Европа'                                                                     =>'EU',
'Финляндия'                                                                  =>'FI',
'Фиджи'                                                                      =>'FJ',
'Фолклендские о-ва'                                                          =>'FK',
'Микронезия'                                                                 =>'FM',
'Фарерские о-ва'                                                             =>'FO',
'Франция'                                                                    =>'FR',
'Габон'                                                                      =>'GA',
'Гренада'                                                                    =>'GD',
'Грузия'                                                                     =>'GE',
'Гана'                                                                       =>'GH',
'Гибралтар'                                                                  =>'GI',
'Гренландия'                                                                 =>'GL',
'Гамбия'                                                                     =>'GM',
'Гвинея'                                                                     =>'GN',
'Гваделупа'                                                                  =>'GP',
'Экваториальная Гвинея'                                                      =>'GQ',
'Греция'                                                                     =>'GR',
'Гватемала'                                                                  =>'GT',
'Гуам'                                                                       =>'GU',
'Гвинея-Бисау'                                                               =>'GW',
'Гайана'                                                                     =>'GY',
'Гонконг'                                                                    =>'HK',
'О-ва Хирт и Макдоналдс'                                                     =>'HM',
'Гондурас'                                                                   =>'HN',
'Хорватия'                                                                   =>'HR',
'Гаити'                                                                      =>'HT',
'Венгрия'                                                                    =>'HU',
'Индонезия'                                                                  =>'ID',
'Ирландия'                                                                   =>'IE',
'Израиль'                                                                    =>'IL',
'Индия'                                                                      =>'IN',
'Британские территории в Индийском океане'                                   =>'IO',
'Ирак'                                                                       =>'IQ',
'Иран'                                                                       =>'IR',
'Исландия'                                                                   =>'IS',
'Италия'                                                                     =>'IT',
'italy'                                                                     =>'IT',
'Italy'                                                                     =>'IT',
'Ямайка'                                                                     =>'JM',
'Иордания'                                                                   =>'JO',
'Япония'                                                                     =>'JP',
'Кения'                                                                      =>'KE',
'Киргизстан'                                                                 =>'KG',
'Киргизия'                                                                 =>'KG',
'Камбоджа'                                                                   =>'KH',
'Кирибати'                                                                   =>'KI',
'Коморские о-ва'                                                             =>'KM',
'Сент-Китс и Невис'                                                          =>'KN',
'Северная Корея'                                                             =>'KP',
'Южная Корея'                                                                =>'KR',
'Корея'                                                                =>'KR',
'Кувейт'                                                                     =>'KW',
'Каймановые о-ва'                                                            =>'KY',
'Казахстан'                                                                  =>'KZ',
'Лаос'                                                                       =>'LA',
'Ливан'                                                                      =>'LB',
'Сент-Люсия'                                                                 =>'LC',
'Лихтенштейн'                                                                =>'LI',
'Шри-Ланка'                                                                  =>'LK',
'Либерия'                                                                    =>'LR',
'Лесото'                                                                     =>'LS',
'Литва'                                                                      =>'LT',
'Люксембург'                                                                 =>'LU',
'Латвия'                                                                     =>'LV',
'Ливия'                                                                      =>'LY',
'Марокко'                                                                    =>'MA',
'Монако'                                                                     =>'MC',
'Молдова'                                                                    =>'MD',
'Мадагаскар'                                                                 =>'MG',
'Маршалловы о-ва'                                                            =>'MH',
'Македония'                                                                  =>'MK',
'Мали'                                                                       =>'ML',
'Мьянма'                                                                     =>'MM',
'Монголия'                                                                   =>'MN',
'Макао'                                                                      =>'MO',
'Северные Марианские о-ва'                                                   =>'MP',
'Мартиника'                                                                  =>'MQ',
'Мавритания'                                                                 =>'MR',
'Монтcеррат'                                                                 =>'MS',
'Мальта'                                                                     =>'MT',
'Маврикий'                                                                   =>'MU',
'Мальдивы'                                                                   =>'MV',
'Малави'                                                                     =>'MW',
'Мексика'                                                                    =>'MX',
'Малайзия'                                                                   =>'MY',
'Мозамбик'                                                                   =>'MZ',
'Намибия'                                                                    =>'NA',
'Новая Каледония'                                                            =>'NC',
'Нигер'                                                                      =>'NE',
'О-в Норфолк'                                                                =>'NF',
'Нигерия'                                                                    =>'NG',
'Никарагуа'                                                                  =>'NI',
'Нидерланды'                                                                 =>'NL',
'Голландия'                                                                 =>'NL',
'Норвегия'                                                                   =>'NO',
'Непал'                                                                      =>'NP',
'Науру'                                                                      =>'NR',
'Новая Зеландия'                                                             =>'NZ',
'Оман'                                                                       =>'OM',
'Панама'                                                                     =>'PA',
'Перу'                                                                       =>'PE',
'Французская Полинезия'                                                      =>'PF',
'Папуа - Новая Гвинея'                                                       =>'PG',
'Филиппины'                                                                  =>'PH',
'Пакистан'                                                                   =>'PK',
'Польша'                                                                     =>'PL',
'Сен-Пьер и Микелон'                                                         =>'PM',
'Пуэрто-Рико'                                                                =>'PR',
'Палестина'                                                                  =>'PS',
'Португалия'                                                                 =>'PT',
'Палау'                                                                      =>'PW',
'Парагвай'                                                                   =>'PY',
'Катар'                                                                      =>'QA',
'О-в Реюньон'                                                                =>'RE',
'Румыния'                                                                    =>'RO',
'Россия'                                                                     =>'RU',
'Руанда'                                                                     =>'RW',
'Саудовская Аравия'                                                          =>'SA',
'Соломоновы о-ва'                                                            =>'SB',
'Сейшелы'                                                                    =>'SC',
'Seychelles'                                                                    =>'SC',
'Судан'                                                                      =>'SD',
'Швеция'                                                                     =>'SE',
'Сингапур'                                                                   =>'SG',
'Словения'                                                                   =>'SI',
'Словакия'                                                                   =>'SK',
'Сьерра-Леоне'                                                               =>'SL',
'Сан-Марино'                                                                 =>'SM',
'Сенегал'                                                                    =>'SN',
'Сомали'                                                                     =>'SO',
'Суринам'                                                                    =>'SR',
'Сан-Томе и Принсипи'                                                        =>'ST',
'СССР'                                                                       =>'SU',
'Сальвадор'                                                                  =>'SV',
'Сирия'                                                                      =>'SY',
'Свазиленд'                                                                  =>'SZ',
'О-ва Теркс и Кайкос'                                                        =>'TC',
'Чад'                                                                        =>'TD',
'Французские южные территории'                                               =>'TF',
'Того'                                                                       =>'TG',
'Таиланд'                                                                    =>'TH',
'Тайланд'                                                                    =>'TH',
'Таджикистан'                                                                =>'TJ',
'Туркменистан'                                                               =>'TM',
'Тунис'                                                                      =>'TN',
'Тонга'                                                                      =>'TO',
'Восточный Тимор'                                                            =>'TP',
'Турция'                                                                     =>'TR',
'Тринидад и Тобаго'                                                          =>'TT',
'Тувалу'                                                                     =>'TV',
'Тайвань'                                                                    =>'TW',
'Танзания'                                                                   =>'TZ',
'Украина'                                                                    =>'UA',
'Уганда'                                                                     =>'UG',
'Великобритания'                                                             =>'UK',
'Малые о-ва США'                                                             =>'UM',
'США'                                                                        =>'US',
'Уругвай'                                                                    =>'UY',
'Узбекистан'                                                                 =>'UZ',
'Ватикан'                                                                    =>'VA',
'Сен-Винсент и Гренадины'                                                    =>'VC',
'Венесуэла'                                                                  =>'VE',
'Виргинские о-ва (Британия)'                                                 =>'VG',
'Виргинские о-ва (США)'                                                      =>'VI',
'Вьетнам'                                                                    =>'VN',
'Вануату'                                                                    =>'VU',
'Самоа'                                                                      =>'WS',
'Йемен'                                                                      =>'YE',
'Югославия'                                                                  =>'YU',
'Южная Африка'                                                               =>'ZA',
'Замбия'                                                                     =>'ZM',
'Заир'                                                                       =>'ZR',
'Зимбабве'                                                                   =>'ZW');


	while((time()-$starttime)<2 && $skip<$allwork) {
		$pp=ms("SELECT `id`,`whois` FROM `dnevnik_comm` WHERE ".installmod_where()." LIMIT 100","_a",0);
		foreach($pp as $p) { $s=$p['whois']; $ok=0;
		    if($s=="\001") { $c=''; $ok=1; }

		    elseif(strstr($s,'|')) { list($country,$city,)=explode('|',$s,3); 
if(strlen($country)>2) idie("Error len: ".h($country));
$c=$country.' '.$city; $ok=1; }

		    elseif(strstr($s,"\001")) { list($city,$c,)=explode("\001",$s,2);
if(isset($flgs[$c])) { $ok=1; $country=$flgs[$c]; }
elseif($city=='Montenegro') { $city=''; $country='ME'; $ok=1; }
elseif($city=='Santa Clara') { $country='CU'; $ok=1; }
elseif($city=='Wholesale') { $ok=-1; }
else $country='ERROR ['.h($c).']';
$c=$country.' '.$city; }
		    else $c="ERROR";

		    if($ok==1) msq_update('dnevnik_comm',array('whois'=>e($c)),"WHERE `id`='".$p['id']."'");
		    elseif($ok==-1) msq_update('dnevnik_comm',array('whois'=>''),"WHERE `id`='".$p['id']."'");
		    else $o.="<div>".$p['id'].") ".h($c)."</div>".$GLOBALS['msqe'];
		}
		usleep(100000);
		$skip+=100;
	}

	$o.=" ".$skip;
	if($skip<$allwork) return $skip;
	$delknopka=1;
	return 0;
}

// Определяем общий объем предстоящей работы (напр. число позиций в базе для обработки).
// Если модуль одноразового запуска - вернуть 0.
function installmod_allwork() { return ms("SELECT COUNT(*) FROM `dnevnik_comm` WHERE ".installmod_where(),"_l",0); }

?>